In [9]:
import numpy as np

In [6]:
import pandas as pd

In [5]:
labels=['a','b','c']
my_data =[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(my_data,labels) # you don't need to put equal if you put them in order

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [18]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [19]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [23]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [25]:
ser1['USA']# you can look for items like you do in dictionary with string, but here you can enter a number

1

In [27]:
ser3=pd.Series(data=labels)

In [28]:
ser3[0]

'a'

In [31]:
ser1+ser2# it will search for a match to add them together and will add the index

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [30]:
# note every index will turn into a float to save data

## Data Frames

In [1]:
from numpy.random import randn

In [10]:
np.random.seed(101)

In [12]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A -0.518101 -0.334404 -1.218796  1.632757
B -0.069429 -1.002131  2.037074  0.715992
C  1.814369  0.018003  1.206281  0.828974
D -0.649561 -1.029917  0.225625  0.162955
E  0.121118  0.528868  1.980859  2.275122

In [13]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
type(df['W'])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df['W']['A']

2.706849839399938

In [21]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
df['W']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: W, dtype: float64

In [21]:
df[['W','Z']]

          W         Z
A  1.693723 -0.134841
B  0.390528  0.807706
C  0.072960 -0.497104
D -0.754070 -0.116773
E  1.901755 -0.993263

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
randn (3,3)

array([[ 2.70684984,  0.62813271,  0.90796945],
       [ 0.50382575,  0.65111795, -0.31931804],
       [-0.84807698,  0.60596535, -2.01816824]])

In [6]:
Data1=pd.DataFrame(randn(3,3),['x1','x2','x3'],['theta1','theta2','theta3'])

In [7]:
Data1

      theta1    theta2    theta3
x1  0.740122  0.528813 -0.589001
x2  0.188695 -0.758872 -0.933237
x3  0.955057  0.190794  1.978757

In [8]:
pd.Series(randn(3),['x1','x2','x3'])

x1    2.605967
x2    0.683509
x3    0.302665
dtype: float64

In [9]:
type(Data1)

pandas.core.frame.DataFrame

In [23]:
df.W
    # dot + column name, but that may cause a problem in methods

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: W, dtype: float64

In [24]:
df[['W','Z']]

          W         Z
A  1.693723 -0.134841
B  0.390528  0.807706
C  0.072960 -0.497104
D -0.754070 -0.116773
E  1.901755 -0.993263

In [25]:
# To creat a new element

In [27]:
df['new']=df['W']+df['Y']# deal with new as it already exist, and it's an operation

In [28]:
df

          W         X         Y         Z       new
A  1.693723 -1.706086 -1.159119 -0.134841  0.534604
B  0.390528  0.166905  0.184502  0.807706  0.575030
C  0.072960  0.638787  0.329646 -0.497104  0.402606
D -0.754070 -0.943406  0.484752 -0.116773 -0.269318
E  1.901755  0.238127  1.996652 -0.993263  3.898407

In [29]:
# To removee column

In [34]:
df.drop('new',1) 
    # you need to define which axis as default is 0 (x)

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [38]:
# note that it only call Datat frame without colum, to totaly remove it:

In [39]:
df.drop('new',axis=1,inplace=True)

In [40]:
df

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [41]:
# to drop raws

In [42]:
df.drop('E')

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773

In [43]:
df.shape 
# It's an index of a 2D array

(5, 4)

In [46]:
# To call Rows use loc[] (location fn)
df.loc['A']

W    1.693723
X   -1.706086
Y   -1.159119
Z   -0.134841
Name: A, dtype: float64

In [47]:
# that means that both x, y is a series

In [51]:
 df.iloc[1] # to call by numerical based index not index

W    0.390528
X    0.166905
Y    0.184502
Z    0.807706
Name: B, dtype: float64

In [54]:
df.loc[['A','B']]

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706

In [59]:
df.loc['A','W'] # row then column

1.693722925204035

In [62]:
df.loc[['A','B'],['X','Y']] # list of y,x

          X         Y
A -1.706086 -1.159119
B  0.166905  0.184502

## Data Frames (Conditional Selection, Set, and Reset)

In [132]:
# Conditional Selection

In [22]:
df>0 # return Boolean like in numpy

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [23]:
booldf=df>0

In [24]:
df[booldf] # it will return NaN if false (To mix both)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df>0]# Syntax <DF name>[Condition]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [27]:
df[df['W']>0]# it will be used to filter the less than one

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
resultdf=df[df['Z']<0] # it will return all the series in index x that satify the condition

In [82]:
resultdf
    # to get a slice

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [89]:
df[df['W']>0]['X']
    # That means that we now deal with new DataFrame, so we can grab anything from it

A   -1.706086
B    0.166905
C    0.638787
E    0.238127
Name: X, dtype: float64

In [95]:
df[df['W']>0][['X','Y']] # grab multi series

          X         Y
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
E  0.238127  1.996652

In [96]:
boolser=df['W']>0
result=df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A -1.159119 -1.706086
B  0.184502  0.166905
C  0.329646  0.638787
E  1.996652  0.238127

In [114]:
x=df[df['W']>0][['X','Y']]

In [115]:
x

          X         Y
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
E  0.238127  1.996652

In [116]:
x['X']['A']

-1.7060859307350775

In [153]:
df[df['W']>0] and df[df['X']>0]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [133]:
# It means and, and or can't be used many True, and false, so use & instead
# multiple condtion

In [129]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
E  1.901755  0.238127  1.996652 -0.993263

In [130]:
df[(df['W']>0) | (df['Y']>0)] # use ()

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [134]:
# Index(reseting, or seting it to something else)

In [154]:
# To Reset the index

In [136]:
df.reset_index() 
    # you will get the index reset to a column and a new index of numbers

  index         W         X         Y         Z
0     A  1.693723 -1.706086 -1.159119 -0.134841
1     B  0.390528  0.166905  0.184502  0.807706
2     C  0.072960  0.638787  0.329646 -0.497104
3     D -0.754070 -0.943406  0.484752 -0.116773
4     E  1.901755  0.238127  1.996652 -0.993263

In [138]:
df.reset_index()
    # To replace use inplace= True

  index         W         X         Y         Z
0     A  1.693723 -1.706086 -1.159119 -0.134841
1     B  0.390528  0.166905  0.184502  0.807706
2     C  0.072960  0.638787  0.329646 -0.497104
3     D -0.754070 -0.943406  0.484752 -0.116773
4     E  1.901755  0.238127  1.996652 -0.993263

In [152]:
# To set Index

In [28]:
newind = 'CA NY WY Or CO'.split()# rather than writing each comma

In [29]:
newind

['CA', 'NY', 'WY', 'Or', 'CO']

In [30]:
df['states']=newind

In [31]:
type(newind)

list

In [151]:
df.set_index('states') 
    # to put another index

               W         X         Y         Z
states
CA      1.693723 -1.706086 -1.159119 -0.134841
NY      0.390528  0.166905  0.184502  0.807706
WY      0.072960  0.638787  0.329646 -0.497104
Or     -0.754070 -0.943406  0.484752 -0.116773
CO      1.901755  0.238127  1.996652 -0.993263

## Data Frames3 (Multiindex, and index hierarchy)

In [4]:
# Index Levels
outside='G1 G1 G1 G2 G2 G2'.split()
inside='1 2 3 1 2 3'.split()
hier_index= list(zip(outside,inside)) # to turn it to tuples pairs
hier_index= pd.MultiIndex.from_tuples(hier_index)# customization of making a data frame with many levels

In [5]:
hier_index

MultiIndex([('G1', '1'),
            ('G1', '2'),
            ('G1', '3'),
            ('G2', '1'),
            ('G2', '2'),
            ('G2', '3')],
           )

In [11]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [12]:
df # level 1 is G1, G2 the level 2 is 1 2 3 (index hierarchy)

             A         B
G1 1  1.413856  0.177042
   2 -0.410110  1.252223
   3  1.316289 -1.984163
G2 1  1.140533 -0.002922
   2  0.389176 -0.413443
   3 -0.918721 -1.404698

In [13]:
# To call data from index hierarchy

In [177]:
df.loc['G1']

          A         B
1  0.196800 -1.136645
2  0.000366  1.025984
3 -0.156598 -0.031579

In [179]:
df['A']['G1']

1    0.196800
2    0.000366
3   -0.156598
Name: A, dtype: float64

In [181]:
df.loc['G1'].iloc[1]

A    0.000366
B    1.025984
Name: 2, dtype: float64

In [182]:
# to name G1, G2

In [183]:
df.index.names

FrozenList([None, None])

In [224]:
df.index.names=['Groups','Num']

In [225]:
df

                   A         B
Groups Num
G1     1    0.196800 -1.136645
       2    0.000366  1.025984
       3   -0.156598 -0.031579
G2     1    0.649826  2.154846
       2   -0.610259 -0.755325
       3   -0.346419  0.147027

In [217]:
df.loc['G2']['B'][1] # To call only one number

-0.755325340010558

In [218]:
# Cross Section function( cross section of rows and columns)

In [236]:
#df.xs(1,level='Num')

In [235]:
#df.xs(1,level='Num')

In [237]:
df.xs('G1')

            A         B
Num
1    0.196800 -1.136645
2    0.000366  1.025984
3   -0.156598 -0.031579